read_verilog clk_f.v
hierarchy -check -top clk_1f
proc; opt; fsm; opt; memory; opt
techmap; opt
write_verilog synth_1f.v