read_verilog clk_4f.v
hierarchy -check -top clk_4f
proc; opt; fsm; opt; memory; opt
techmap; opt
write_verilog synth_4f.v